zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/devices/COMPONENT_CAT1C/include/cy_device.h
/***************************************************************************//**
* \file cy_device.h
* \version 2.3
*
* This file specifies the structure for core and peripheral block HW base
* addresses, versions, and parameters.
*
********************************************************************************/
#ifndef CY_DEVICE_H_
#define CY_DEVICE_H_

#include <stdint.h>
#include <stddef.h>
#include "cy_utils.h"
#include "cy_device_headers.h"
#include "startup_cat1c.h"
#if (CY_IP_M7CPUSS_VERSION == 2)
#include "cyip_cpuss_v2.h"
#else
#include "cyip_cpuss.h"
#endif

CY_MISRA_FP_BLOCK_START('MISRA C-2012 Rule 8.6', 1, \
'Checked manually. The definition is a part of linker script.')

/* Device descriptor type */
typedef struct
{
    /* Base HW addresses */
    uint32_t hsiomBase;
    uint32_t gpioBase;

    /* IP block versions: [7:4] major, [3:0] minor */
    uint8_t  dwVersion;

    /* Parameters */
    uint8_t  cpussDw0ChNr;
    uint8_t  cpussDw1ChNr;
    uint8_t  epMonitorNr;

    /* Peripheral register offsets */

   /* DW registers */
    uint16_t dwChOffset;
    uint16_t dwChSize;
    uint8_t  dwChCtlPrioPos;
    uint8_t  dwChCtlPreemptablePos;
    uint8_t  dwStatusChIdxPos;
    uint32_t dwStatusChIdxMsk;

    uint8_t  tcpwmCC1Present;
    uint8_t  tcpwmAMCPresent;
    uint8_t  tcpwmSMCPrecent;

} cy_stc_device_t;

void Cy_PDL_Init(const cy_stc_device_t * device);

/* Pointer to device configuration structure */
#define CY_DEVICE_CFG                   (&cy_deviceIpBlockCfg)

/*******************************************************************************
*                   Global Variables
*******************************************************************************/

extern const cy_stc_device_t   cy_deviceIpBlockCfg;
extern const cy_stc_device_t* cy_device;

/*******************************************************************************
*                   Global Extern Functions
*******************************************************************************/

#if defined(__ARMCC_VERSION)
#define interrupt_type __attribute__((interrupt))
#elif defined (__GNUC__)
#define interrupt_type __attribute__((interrupt))
#elif defined (__ICCARM__)
#define interrupt_type __irq
#else
    #error "An unsupported toolchain"
#endif  /* (__ARMCC_VERSION) */

/*******************************************************************************
*               Macro Definitions
*******************************************************************************/
/*******************************************************************************
*               Register Access Helper Macros
*******************************************************************************/
#define CY_DEVICE_CAT1C            /* Device Category */
#define CY_CRYPTO_V1                        (0U) /* CAT1C devices have only mxcrypto_v2 IP */

/* Remapping the CBUS to SAHB address & Vice versa*/
#define CY_REMAP_ADDRESS_CBUS_TO_SAHB(addr)               (addr)
#define CY_REMAP_ADDRESS_SAHB_TO_CBUS(addr)               (addr)

/*******************************************************************************
*                System Level
*******************************************************************************/
#define ENABLE_CM7_INSTRUCTION_CACHE
#if !defined CY_DISABLE_XMC7000_DATA_CACHE && !defined CY_DISABLE_DATA_CACHE 
#define ENABLE_CM7_DATA_CACHE
#endif

/*******************************************************************************
*               Generic Macro Definitions
*******************************************************************************/
#define GET_ALIAS_ADDRESS(addr)             (uint32_t)(addr)

/*******************************************************************************
*                CRYPTO
*******************************************************************************/

/* The CRYPTO internal-memory buffer-size in 32-bit words. */
#define CY_CRYPTO_MEM_BUFF_SIZE_U32         (2048U)

/*******************************************************************************
*                SYSLIB
*******************************************************************************/
#if defined(CORE_NAME_CM7_0) || defined(CORE_NAME_CM7_1) || defined(CORE_NAME_CM7_2) || defined(CORE_NAME_CM7_3)
#define CY_SYSLIB_DELAY_CALIBRATION_FACTOR    2U
#else
#define CY_SYSLIB_DELAY_CALIBRATION_FACTOR    1U
#endif

/*******************************************************************************
*                SRSS
*******************************************************************************/

#define CY_SRSS_NUM_CLKPATH                 SRSS_NUM_CLKPATH
#define CY_SRSS_NUM_PLL                     SRSS_NUM_TOTAL_PLL
#define CY_SRSS_NUM_PLL200M                 SRSS_NUM_PLL
#define CY_SRSS_NUM_PLL400M                 SRSS_NUM_PLL400M
#define CY_SRSS_NUM_HFROOT                  SRSS_NUM_HFROOT
#define CY_SRSS_ECO_PRESENT                 SRSS_ECO_PRESENT
#define CY_SRSS_FLL_PRESENT                 1
#define CY_SRSS_PLL_PRESENT                 SRSS_NUM_PLL
#define CY_SRSS_PLL400M_PRESENT             1
#define CY_SRSS_ALTHF_PRESENT               SRSS_ALTHF_PRESENT
#define CY_SRSS_DPLL_LP_PRESENT             0
#define CY_SRSS_IMO_PRESENT                 1

#define CY_SRSS_ILO_COUNT                   2

/** HF PATH # used for PERI PCLK */
#define CY_SYSCLK_CLK_PERI_HF_PATH_NUM     2U

/** HF PATH # used for MEM CLK */
#define CY_SYSCLK_CLK_MEM_HF_PATH_NUM     0U


/** HF PATH # used for Core */
#ifdef CORE_NAME_CM0P_0
#define CY_SYSCLK_CLK_CORE_HF_PATH_NUM     0U
#else
#define CY_SYSCLK_CLK_CORE_HF_PATH_NUM     1U
#endif

/** HF PATH # used for CLOCK FAST */
#define CY_SYSCLK_CLK_FAST_HF_NUM          1U

/* HF PATH # Max Allowed Frequencies */
#define CY_SYSCLK_HF_MAX_FREQ(hfNum)       (350000000U)

/** FLL Max Frequency */
#define  CY_SYSCLK_FLL_MAX_OUTPUT_FREQ     (100000000UL)

/* Technology Independant Register set */
#define SRSS_CLK_DSI_SELECT                 (((SRSS_Type *) SRSS)->CLK_DSI_SELECT)
#define SRSS_CLK_OUTPUT_FAST                (((SRSS_Type *) SRSS)->CLK_OUTPUT_FAST)
#define SRSS_CLK_OUTPUT_SLOW                (((SRSS_Type *) SRSS)->CLK_OUTPUT_SLOW)
#define SRSS_CLK_CAL_CNT1                   (((SRSS_Type *) SRSS)->CLK_CAL_CNT1)
#define SRSS_CLK_CAL_CNT2                   (((SRSS_Type *) SRSS)->CLK_CAL_CNT2)
#define SRSS_SRSS_INTR                      (((SRSS_Type *) SRSS)->SRSS_INTR)
#define SRSS_SRSS_INTR_SET                  (((SRSS_Type *) SRSS)->SRSS_INTR_SET)
#define SRSS_SRSS_INTR_MASK                 (((SRSS_Type *) SRSS)->SRSS_INTR_MASK)
#define SRSS_SRSS_INTR_MASKED               (((SRSS_Type *) SRSS)->SRSS_INTR_MASKED)
#define SRSS_PWR_CTL                        (((SRSS_Type *) SRSS)->PWR_CTL)
#define SRSS_PWR_CTL2                       (((SRSS_Type *) SRSS)->PWR_CTL2)
#define SRSS_PWR_HIBERNATE                  (((SRSS_Type *) SRSS)->PWR_HIBERNATE)
#define SRSS_PWR_BUCK_CTL                   (((SRSS_Type *) SRSS)->PWR_BUCK_CTL)
#define SRSS_PWR_BUCK_CTL2                  (((SRSS_Type *) SRSS)->PWR_BUCK_CTL2)
#define SRSS_PWR_SSV_CTL                    (((SRSS_Type *) SRSS)->PWR_SSV_CTL)
#define SRSS_PWR_SSV_STATUS                 (((SRSS_Type *) SRSS)->PWR_SSV_STATUS)
#define SRSS_PWR_LVD_CTL                    (((SRSS_Type *) SRSS)->PWR_LVD_CTL)
#define SRSS_PWR_LVD_CTL2                   (((SRSS_Type *) SRSS)->PWR_LVD_CTL2)
#define SRSS_PWR_REGHC_CTL                  (((SRSS_Type *) SRSS)->PWR_REGHC_CTL)
#define SRSS_PWR_REGHC_STATUS               (((SRSS_Type *) SRSS)->PWR_REGHC_STATUS)
#define SRSS_PWR_REGHC_CTL2                 (((SRSS_Type *) SRSS)->PWR_REGHC_CTL2)
#define SRSS_PWR_REGHC_CTL4                 (((SRSS_Type *) SRSS)->PWR_REGHC_CTL4)
#define SRSS_PWR_HIB_DATA                   (((SRSS_Type *) SRSS)->PWR_HIB_DATA)
#define SRSS_PWR_PMIC_CTL                   (((SRSS_Type *) SRSS)->PWR_PMIC_CTL)
#define SRSS_PWR_PMIC_STATUS                (((SRSS_Type *) SRSS)->PWR_PMIC_STATUS)
#define SRSS_PWR_PMIC_CTL2                  (((SRSS_Type *) SRSS)->PWR_PMIC_CTL2)
#define SRSS_PWR_PMIC_CTL4                  (((SRSS_Type *) SRSS)->PWR_PMIC_CTL4)
#define SRSS_CLK_PATH_SELECT                (((SRSS_Type *) SRSS)->CLK_PATH_SELECT)
#define SRSS_CLK_ROOT_SELECT                (((SRSS_Type *) SRSS)->CLK_ROOT_SELECT)
#define SRSS_CLK_DIRECT_SELECT              (((SRSS_Type *) SRSS)->CLK_DIRECT_SELECT)
#define SRSS_CLK_ECO_STATUS                 (((SRSS_Type *) SRSS)->CLK_ECO_STATUS)
#define SRSS_CLK_ILO_CONFIG                 (((SRSS_Type *) SRSS)->CLK_ILO0_CONFIG) /* BWC */
#define SRSS_CLK_ILO0_CONFIG                (((SRSS_Type *) SRSS)->CLK_ILO0_CONFIG)
#define SRSS_CLK_ILO1_CONFIG                (((SRSS_Type *) SRSS)->CLK_ILO1_CONFIG)

#define SRSS_CLK_ILO_CONFIG_ENABLE_Msk      SRSS_CLK_ILO0_CONFIG_ENABLE_Msk /* BWC */

