zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/devices/COMPONENT_CAT1C/include/cy_device.h
#define SRSS_CLK_TRIM_ILO_CTL               (((SRSS_Type *) SRSS)->CLK_TRIM_ILO_CTL)
#define SRSS_CLK_PILO_CONFIG                (((SRSS_Type *) SRSS)->CLK_PILO_CONFIG)
#define SRSS_CLK_ECO_CONFIG                 (((SRSS_Type *) SRSS)->CLK_ECO_CONFIG)
#define SRSS_CLK_ECO_CONFIG2                 (((SRSS_Type *) SRSS)->CLK_ECO_CONFIG2)
#define SRSS_CLK_MFO_CONFIG                 (((SRSS_Type *) SRSS)->CLK_MFO_CONFIG)
#define SRSS_CLK_IHO_CONFIG                 (((SRSS_Type *) SRSS)->CLK_IHO_CONFIG)
#define SRSS_CLK_ALTHF_CTL                  (((SRSS_Type *) SRSS)->CLK_ALTHF_CTL)

#define SRSS_CLK_ILO0_CONFIG                 (((SRSS_Type *) SRSS)->CLK_ILO0_CONFIG)
#define SRSS_CLK_ILO1_CONFIG                 (((SRSS_Type *) SRSS)->CLK_ILO1_CONFIG)

#define SRSS_CSV_HF                         (((SRSS_Type *) SRSS)->CSV_HF)
#define SRSS_CLK_SELECT                     (((SRSS_Type *) SRSS)->CLK_SELECT)
#define SRSS_CLK_TIMER_CTL                  (((SRSS_Type *) SRSS)->CLK_TIMER_CTL)
#define SRSS_CLK_IMO_CONFIG                 (((SRSS_Type *) SRSS)->CLK_IMO_CONFIG)
#define SRSS_CLK_ECO_PRESCALE               (((SRSS_Type *) SRSS)->CLK_ECO_PRESCALE)
#define SRSS_CLK_MF_SELECT                  (((SRSS_Type *) SRSS)->CLK_MF_SELECT)
#define SRSS_CSV_REF_SEL                    (((SRSS_Type *) SRSS)->CSV_REF_SEL)
#define SRSS_CSV_REF                        (((SRSS_Type *) SRSS)->CSV_REF)
#define SRSS_CSV_LF                         (((SRSS_Type *) SRSS)->CSV_LF)
#define SRSS_CSV_ILO                        (((SRSS_Type *) SRSS)->CSV_ILO)
#define SRSS_RES_CAUSE                      (((SRSS_Type *) SRSS)->RES_CAUSE)
#define SRSS_RES_CAUSE2                     (((SRSS_Type *) SRSS)->RES_CAUSE2)
#define SRSS_RES_CAUSE_EXTEND               (((SRSS_Type *) SRSS)->RES_CAUSE_EXTEND)
#define SRSS_CLK_LP_PLL                     (((SRSS_Type *) SRSS)->CLK_LP_PLL)
#define SRSS_CLK_IHO                        (((SRSS_Type *) SRSS)->CLK_IHO)
#define SRSS_TST_XRES_SECURE                (((SRSS_Type *) SRSS)->TST_XRES_SECURE)
#define SRSS_RES_PXRES_CTL                  (((SRSS_Type *) SRSS)->RES_PXRES_CTL)

#define SRSS_CSV_HF_CSV_REF_CTL(hf)         (((SRSS_Type *) SRSS)->CSV_HF_STRUCT.CSV[hf].REF_CTL)
#define SRSS_CSV_HF_CSV_REF_LIMIT(hf)       (((SRSS_Type *) SRSS)->CSV_HF_STRUCT.CSV[hf].REF_LIMIT)
#define SRSS_CSV_HF_CSV_MON_CTL(hf)         (((SRSS_Type *) SRSS)->CSV_HF_STRUCT.CSV[hf].MON_CTL)
#define CSV_HF_CSV_REF_CTL_CSV_STARTUP      CSV_HF_CSV_REF_CTL_STARTUP
#define CSV_HF_CSV_REF_LIMIT_CSV_LOWER      CSV_HF_CSV_REF_LIMIT_LOWER
#define CSV_HF_CSV_REF_LIMIT_CSV_UPPER      CSV_HF_CSV_REF_LIMIT_UPPER
#define CSV_HF_CSV_MON_CTL_CSV_PERIOD       CSV_HF_CSV_MON_CTL_PERIOD

#define SRSS_CSV_LF_CSV_REF_CTL             (((SRSS_Type *) SRSS)->CSV_LF_STRUCT.CSV.REF_CTL)
#define SRSS_CSV_LF_CSV_REF_LIMIT           (((SRSS_Type *) SRSS)->CSV_LF_STRUCT.CSV.REF_LIMIT)
#define SRSS_CSV_LF_CSV_MON_CTL             (((SRSS_Type *) SRSS)->CSV_LF_STRUCT.CSV.MON_CTL)
#define CSV_LF_CSV_REF_CTL_CSV_STARTUP      CSV_LF_CSV_REF_CTL_STARTUP
#define CSV_LF_CSV_REF_LIMIT_CSV_LOWER      CSV_LF_CSV_REF_LIMIT_LOWER
#define CSV_LF_CSV_REF_LIMIT_CSV_UPPER      CSV_LF_CSV_REF_LIMIT_UPPER
#define CSV_LF_CSV_MON_CTL_CSV_PERIOD       CSV_LF_CSV_MON_CTL_PERIOD

#define SRSS_CSV_REF_CSV_REF_CTL            (((SRSS_Type *) SRSS)->CSV_REF_STRUCT.CSV.REF_CTL)
#define SRSS_CSV_REF_CSV_REF_LIMIT          (((SRSS_Type *) SRSS)->CSV_REF_STRUCT.CSV.REF_LIMIT)
#define SRSS_CSV_REF_CSV_MON_CTL            (((SRSS_Type *) SRSS)->CSV_REF_STRUCT.CSV.MON_CTL)
#define CSV_REF_CSV_REF_CTL_CSV_STARTUP     CSV_REF_CSV_REF_CTL_STARTUP
#define CSV_REF_CSV_REF_LIMIT_CSV_LOWER     CSV_REF_CSV_REF_LIMIT_LOWER
#define CSV_REF_CSV_REF_LIMIT_CSV_UPPER     CSV_REF_CSV_REF_LIMIT_UPPER
#define CSV_REF_CSV_MON_CTL_CSV_PERIOD      CSV_REF_CSV_MON_CTL_PERIOD

#define SRSS_CSV_ILO_CSV_REF_CTL            (((SRSS_Type *) SRSS)->CSV_ILO_STRUCT.CSV.REF_CTL)
#define SRSS_CSV_ILO_CSV_REF_LIMIT          (((SRSS_Type *) SRSS)->CSV_ILO_STRUCT.CSV.REF_LIMIT)
#define SRSS_CSV_ILO_CSV_MON_CTL            (((SRSS_Type *) SRSS)->CSV_ILO_STRUCT.CSV.MON_CTL)
#define CSV_ILO_CSV_REF_CTL_CSV_STARTUP     CSV_ILO_CSV_REF_CTL_STARTUP
#define CSV_ILO_CSV_REF_LIMIT_CSV_LOWER     CSV_ILO_CSV_REF_LIMIT_LOWER
#define CSV_ILO_CSV_REF_LIMIT_CSV_UPPER     CSV_ILO_CSV_REF_LIMIT_UPPER
#define CSV_ILO_CSV_MON_CTL_CSV_PERIOD      CSV_ILO_CSV_MON_CTL_PERIOD

#define SRSS_CLK_FLL_CONFIG                 (((SRSS_Type *) SRSS)->CLK_FLL_CONFIG)
#define SRSS_CLK_FLL_CONFIG2                (((SRSS_Type *) SRSS)->CLK_FLL_CONFIG2)
#define SRSS_CLK_FLL_CONFIG3                (((SRSS_Type *) SRSS)->CLK_FLL_CONFIG3)
#define SRSS_CLK_FLL_CONFIG4                (((SRSS_Type *) SRSS)->CLK_FLL_CONFIG4)
#define SRSS_CLK_FLL_STATUS                 (((SRSS_Type *) SRSS)->CLK_FLL_STATUS)

#define SRSS_PWR_LVD_STATUS                 (((SRSS_Type *) SRSS)->PWR_LVD_STATUS)
#define SRSS_PWR_LVD_STATUS2                 (((SRSS_Type *) SRSS)->PWR_LVD_STATUS2)

#define SRSS_SRSS_INTR_CFG                  (((SRSS_Type *) SRSS)->SRSS_AINTR_CFG)

#define SRSS_PWR_HIB_WAKE_CTL               (((SRSS_Type *) SRSS)->PWR_HIB_WAKE_CTL)
#define SRSS_PWR_HIB_WAKE_CTL2              (((SRSS_Type *) SRSS)->PWR_HIB_WAKE_CTL2)
#define SRSS_PWR_HIB_WAKE_CAUSE             (((SRSS_Type *) SRSS)->PWR_HIB_WAKE_CAUSE)
#define SRSS_RES_SOFT_CTL                   (((SRSS_Type *) SRSS)->RES_SOFT_CTL)

#define SRSS_CLK_PLL_CONFIG                 (((SRSS_Type *) SRSS)->CLK_PLL_CONFIG)
#define SRSS_CLK_PLL_STATUS                 (((SRSS_Type *) SRSS)->CLK_PLL_STATUS)

#define SRSS_FLL_PATH_NUM         (0UL)

#if defined (CY_DEVICE_TVIIC2D6M) || defined (CY_DEVICE_TVIIC2D4M)
#define SRSS_PLL_400M_0_PATH_NUM  (1UL)
#define SRSS_PLL_400M_1_PATH_NUM  (2UL)
#define SRSS_PLL_400M_2_PATH_NUM  (3UL)
#define SRSS_PLL_400M_3_PATH_NUM  (4UL)
#define SRSS_PLL_400M_4_PATH_NUM  (5UL)
#define SRSS_PLL_200M_0_PATH_NUM  (6UL)
#define SRSS_PLL_200M_1_PATH_NUM  (7UL)
#define SRSS_PLL_200M_2_PATH_NUM  (8UL)
#else
#define SRSS_PLL_400M_0_PATH_NUM  (1UL)
#define SRSS_PLL_400M_1_PATH_NUM  (2UL)
#define SRSS_PLL_200M_0_PATH_NUM  (3UL)
#define SRSS_PLL_200M_1_PATH_NUM  (4UL)
#endif

