zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/devices/COMPONENT_CAT1C/include/cy_device.h
/*******************************************************************************
*                FLASHC
*******************************************************************************/

#if ((CPUSS_FLASHC_PRESENT == 1) && (CPUSS_FLASHC_ECT == 1))
#define CY_IP_MXFLASHC_VERSION_ECT
#endif

#define FLASHC_FLASH_CTL             (((FLASHC_Type *)(FLASHC))->FLASH_CTL)
#define FLASHC_FLASH_PWR_CTL         (((FLASHC_Type *)(FLASHC))->FLASH_PWR_CTL)
#define FLASHC_FLASH_CMD             (((FLASHC_Type *)(FLASHC))->FLASH_CMD)
#define FLASHC_ECC_CTL               (((FLASHC_Type *)(FLASHC))->ECC_CTL)
#define FLASHC_FM_SRAM_ECC_CTL0      (((FLASHC_Type *)(FLASHC))->FM_SRAM_ECC_CTL0)
#define FLASHC_FM_SRAM_ECC_CTL1      (((FLASHC_Type *)(FLASHC))->FM_SRAM_ECC_CTL1)
#define FLASHC_FM_SRAM_ECC_CTL2      (((FLASHC_Type *)(FLASHC))->FM_SRAM_ECC_CTL2)
#define FLASHC_FM_SRAM_ECC_CTL3      (((FLASHC_Type *)(FLASHC))->FM_SRAM_ECC_CTL3)
#define FLASHC_CM0_CA_CTL0           (((FLASHC_Type *)(FLASHC))->CM0_CA_CTL0)
#define FLASHC_CM0_CA_CTL1           (((FLASHC_Type *)(FLASHC))->CM0_CA_CTL1)
#define FLASHC_CM0_CA_CTL2           (((FLASHC_Type *)(FLASHC))->CM0_CA_CTL2)
#define FLASHC_CM0_CA_STATUS0        (((FLASHC_Type *)(FLASHC))->CM0_CA_STATUS0)
#define FLASHC_CM0_CA_STATUS1        (((FLASHC_Type *)(FLASHC))->CM0_CA_STATUS1)
#define FLASHC_CM0_CA_STATUS2        (((FLASHC_Type *)(FLASHC))->CM0_CA_STATUS2)
#define FLASHC_CM0_STATUS            (((FLASHC_Type *)(FLASHC))->CM0_STATUS)
#define FLASHC_CM7_0_STATUS          (((FLASHC_Type *)(FLASHC))->CM7_0_STATUS)
#define FLASHC_CM7_1_STATUS          (((FLASHC_Type *)(FLASHC))->CM7_1_STATUS)
#if (CY_IP_M7CPUSS_VERSION == 2)
#define FLASHC_CM7_2_STATUS          (((FLASHC_Type *)(FLASHC))->CM7_2_STATUS)
#define FLASHC_CM7_3_STATUS          (((FLASHC_Type *)(FLASHC))->CM7_3_STATUS)
#endif
#define FLASHC_CRYPTO_BUFF_CTL       (((FLASHC_Type *)(FLASHC))->CRYPTO_BUFF_CTL)
#define FLASHC_DW0_BUFF_CTL          (((FLASHC_Type *)(FLASHC))->DW0_BUFF_CTL)
#define FLASHC_DW1_BUFF_CTL          (((FLASHC_Type *)(FLASHC))->DW1_BUFF_CTL)
#define FLASHC_DMAC_BUFF_CTL         (((FLASHC_Type *)(FLASHC))->DMAC_BUFF_CTL)
#define FLASHC_SLOW0_MS_BUFF_CTL     (((FLASHC_Type *)(FLASHC))->SLOW0_MS_BUFF_CTL)
#define FLASHC_SLOW1_MS_BUFF_CTL     (((FLASHC_Type *)(FLASHC))->SLOW1_MS_BUFF_CTL)

/* FLASH Memory  */
#define FLASHC_FM_CTL_ECT_WORK_FLASH_SAFETY (((FLASHC_FM_CTL_ECT_Type *)(FLASHC_FM_CTL_ECT))->WORK_FLASH_SAFETY)
#define FLASHC_FM_CTL_ECT_MAIN_FLASH_SAFETY (((FLASHC_FM_CTL_ECT_Type *)(FLASHC_FM_CTL_ECT))->MAIN_FLASH_SAFETY)
#define FLASHC_FM_CTL_ECT_FLASH_STATUS (((FLASHC_FM_CTL_ECT_Type *)(FLASHC_FM_CTL_ECT))->STATUS)


/*******************************************************************************
*                FLASHC1
*******************************************************************************/

#if defined(FLASHC1)
#define FLASHC1_FLASH_CTL             (((FLASHC1_Type *)(FLASHC1))->FLASH_CTL)
#define FLASHC1_FLASH_PWR_CTL         (((FLASHC1_Type *)(FLASHC1))->FLASH_PWR_CTL)
#define FLASHC1_FLASH_CMD             (((FLASHC1_Type *)(FLASHC1))->FLASH_CMD)
#define FLASHC1_ECC_CTL               (((FLASHC1_Type *)(FLASHC1))->ECC_CTL)
#define FLASHC1_FM_SRAM_ECC_CTL0      (((FLASHC1_Type *)(FLASHC1))->FM_SRAM_ECC_CTL0)
#define FLASHC1_FM_SRAM_ECC_CTL1      (((FLASHC1_Type *)(FLASHC1))->FM_SRAM_ECC_CTL1)
#define FLASHC1_FM_SRAM_ECC_CTL2      (((FLASHC1_Type *)(FLASHC1))->FM_SRAM_ECC_CTL2)
#define FLASHC1_FM_SRAM_ECC_CTL3      (((FLASHC1_Type *)(FLASHC1))->FM_SRAM_ECC_CTL3)
#define FLASHC1_CM0_CA_CTL0           (((FLASHC1_Type *)(FLASHC1))->CM0_CA_CTL0)
#define FLASHC1_CM0_CA_CTL1           (((FLASHC1_Type *)(FLASHC1))->CM0_CA_CTL1)
#define FLASHC1_CM0_CA_CTL2           (((FLASHC1_Type *)(FLASHC1))->CM0_CA_CTL2)
#define FLASHC1_CM0_CA_STATUS0        (((FLASHC1_Type *)(FLASHC1))->CM0_CA_STATUS0)
#define FLASHC1_CM0_CA_STATUS1        (((FLASHC1_Type *)(FLASHC1))->CM0_CA_STATUS1)
#define FLASHC1_CM0_CA_STATUS2        (((FLASHC1_Type *)(FLASHC1))->CM0_CA_STATUS2)
#define FLASHC1_CM0_STATUS            (((FLASHC1_Type *)(FLASHC1))->CM0_STATUS)
#define FLASHC1_CM7_0_STATUS          (((FLASHC1_Type *)(FLASHC1))->CM7_0_STATUS)
#define FLASHC1_CM7_1_STATUS          (((FLASHC1_Type *)(FLASHC1))->CM7_1_STATUS)
#if (CY_IP_M7CPUSS_VERSION == 2)
#define FLASHC1_CM7_2_STATUS          (((FLASHC1_Type *)(FLASHC1))->CM7_2_STATUS)
#define FLASHC1_CM7_3_STATUS          (((FLASHC1_Type *)(FLASHC1))->CM7_3_STATUS)
#endif
#define FLASHC1_CRYPTO_BUFF_CTL       (((FLASHC1_Type *)(FLASHC1))->CRYPTO_BUFF_CTL)
#define FLASHC1_DW0_BUFF_CTL          (((FLASHC1_Type *)(FLASHC1))->DW0_BUFF_CTL)
#define FLASHC1_DW1_BUFF_CTL          (((FLASHC1_Type *)(FLASHC1))->DW1_BUFF_CTL)
#define FLASHC1_DMAC_BUFF_CTL         (((FLASHC1_Type *)(FLASHC1))->DMAC_BUFF_CTL)
#define FLASHC1_SLOW0_MS_BUFF_CTL     (((FLASHC1_Type *)(FLASHC1))->SLOW0_MS_BUFF_CTL)
#define FLASHC1_SLOW1_MS_BUFF_CTL     (((FLASHC1_Type *)(FLASHC1))->SLOW1_MS_BUFF_CTL)
#endif

/*******************************************************************************
*                SFLASH
*******************************************************************************/

#define SFLASH_DIE_YEAR                     (((SFLASH_V1_Type *) SFLASH)->DIE_YEAR)
#define SFLASH_DIE_MINOR                    (((SFLASH_V1_Type *) SFLASH)->DIE_MINOR)
#define SFLASH_DIE_SORT                     (((SFLASH_V1_Type *) SFLASH)->DIE_SORT)
#define SFLASH_DIE_Y                        (((SFLASH_V1_Type *) SFLASH)->DIE_Y)
#define SFLASH_DIE_X                        (((SFLASH_V1_Type *) SFLASH)->DIE_X)
#define SFLASH_DIE_WAFER                    (((SFLASH_V1_Type *) SFLASH)->DIE_WAFER)
#define SFLASH_DIE_LOT(val)                 (((SFLASH_V1_Type *) SFLASH)->DIE_LOT[(val)])
#define SFLASH_FAMILY_ID                    (((SFLASH_V1_Type *) SFLASH)->FAMILY_ID)
#define SFLASH_SI_REVISION_ID               (((SFLASH_V1_Type *) SFLASH)->SI_REVISION_ID)
#define SFLASH_PWR_TRIM_WAKE_CTL            (((SFLASH_V1_Type *) SFLASH)->PWR_TRIM_WAKE_CTL)
#define SFLASH_LDO_0P9V_TRIM                (((SFLASH_V1_Type *) SFLASH)->LDO_0P9V_TRIM)
#define SFLASH_LDO_1P1V_TRIM                (((SFLASH_V1_Type *) SFLASH)->LDO_1P1V_TRIM)
#define SFLASH_BLE_DEVICE_ADDRESS           (((SFLASH_V1_Type *) SFLASH)->BLE_DEVICE_ADDRESS)
#define SFLASH_SILICON_ID                   (((SFLASH_V1_Type *) SFLASH)->SILICON_ID)
#define SFLASH_SINGLE_CORE                  (*(volatile uint8_t *) (SFLASH_BASE + 0xBU))


