zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/devices/COMPONENT_CAT1C/include/cy_device.h
#define SFLASH_CPUSS_TRIM_ROM_CTL_LP        (((SFLASH_V1_Type *) SFLASH)->CPUSS_TRIM_ROM_CTL_LP)
#define SFLASH_CPUSS_TRIM_RAM_CTL_LP        (((SFLASH_V1_Type *) SFLASH)->CPUSS_TRIM_RAM_CTL_LP)
#define SFLASH_CPUSS_TRIM_ROM_CTL_ULP       (((SFLASH_V1_Type *) SFLASH)->CPUSS_TRIM_ROM_CTL_ULP)
#define SFLASH_CPUSS_TRIM_RAM_CTL_ULP       (((SFLASH_V1_Type *) SFLASH)->CPUSS_TRIM_RAM_CTL_ULP)
#define SFLASH_CPUSS_TRIM_ROM_CTL_HALF_LP   (((SFLASH_V1_Type *) SFLASH)->CPUSS_TRIM_ROM_CTL_HALF_LP)
#define SFLASH_CPUSS_TRIM_RAM_CTL_HALF_LP   (((SFLASH_V1_Type *) SFLASH)->CPUSS_TRIM_RAM_CTL_HALF_LP)
#define SFLASH_CPUSS_TRIM_ROM_CTL_HALF_ULP  (((SFLASH_V1_Type *) SFLASH)->CPUSS_TRIM_ROM_CTL_HALF_ULP)
#define SFLASH_CPUSS_TRIM_RAM_CTL_HALF_ULP  (((SFLASH_V1_Type *) SFLASH)->CPUSS_TRIM_RAM_CTL_HALF_ULP)


#define SFLASH_CSD0_ADC_VREF0_TRIM          (((SFLASH_V1_Type *) SFLASH)->CSDV2_CSD0_ADC_VREF0)
#define SFLASH_CSD0_ADC_VREF1_TRIM          (((SFLASH_V1_Type *) SFLASH)->CSDV2_CSD0_ADC_VREF1)
#define SFLASH_CSD0_ADC_VREF2_TRIM          (((SFLASH_V1_Type *) SFLASH)->CSDV2_CSD0_ADC_VREF2)


/*******************************************************************************
*                CPUSS
*******************************************************************************/

/* ARM core registers */
#define SYSTICK_CTRL                        (((SysTick_Type *)SysTick)->CTRL)
#define SYSTICK_LOAD                        (((SysTick_Type *)SysTick)->LOAD)
#define SYSTICK_VAL                         (((SysTick_Type *)SysTick)->VAL)
#define SCB_SCR                             (((SCB_Type *)SCB)->SCR)

#define CPUSS_SYSTICK_CTL                (((CPUSS_Type*) CPUSS_BASE)->SYSTICK_CTL)

#define UDB_UDBIF_BANK_CTL                  (((UDB_V1_Type *) cy_device->udbBase)->UDBIF.BANK_CTL)
#define UDB_BCTL_MDCLK_EN                   (((UDB_V1_Type *) cy_device->udbBase)->BCTL.MDCLK_EN)
#define UDB_BCTL_MBCLK_EN                   (((UDB_V1_Type *) cy_device->udbBase)->BCTL.MBCLK_EN)
#define UDB_BCTL_BOTSEL_L                   (((UDB_V1_Type *) cy_device->udbBase)->BCTL.BOTSEL_L)
#define UDB_BCTL_BOTSEL_U                   (((UDB_V1_Type *) cy_device->udbBase)->BCTL.BOTSEL_U)
#define UDB_BCTL_QCLK_EN_0                  (((UDB_V1_Type *) cy_device->udbBase)->BCTL.QCLK_EN[0U])
#define UDB_BCTL_QCLK_EN_1                  (((UDB_V1_Type *) cy_device->udbBase)->BCTL.QCLK_EN[1U])
#define UDB_BCTL_QCLK_EN_2                  (((UDB_V1_Type *) cy_device->udbBase)->BCTL.QCLK_EN[2U])

#define CPUSS_FAST_0_CLOCK_CTL              (((CPUSS_Type*) CPUSS_BASE)->FAST_0_CLOCK_CTL)
#define CPUSS_FAST_1_CLOCK_CTL              (((CPUSS_Type*) CPUSS_BASE)->FAST_1_CLOCK_CTL)
#define CPUSS_SLOW_CLOCK_CTL                (((CPUSS_Type*) CPUSS_BASE)->SLOW_CLOCK_CTL)
#define CPUSS_MEM_CLOCK_CTL                (((CPUSS_Type*) CPUSS_BASE)->MEM_CLOCK_CTL)
#define CPUSS_PERI_CLOCK_CTL                (((CPUSS_Type*) CPUSS_BASE)->PERI_CLOCK_CTL)

#define CY_CPUSS_NOT_CONNECTED_IRQN          ((uint32_t)disconnected_IRQn)
#define CY_CPUSS_DISCONNECTED_IRQN           ((cy_en_intr_t)CY_CPUSS_NOT_CONNECTED_IRQN)

#define CPUSS_CM0_INT_STATUS_BASE            ((volatile const uint32_t *) &(((CPUSS_Type *)(CPUSS))->CM0_INT0_STATUS))
#define CY_IS_CM0_CORE   ((_FLD2VAL(CPUSS_IDENTITY_MS, CPUSS_IDENTITY) == ((uint32_t)(CPUSS_MS_ID_CM0))) ? true : false)
#define CY_IS_CM7_CORE_0 ((_FLD2VAL(CPUSS_IDENTITY_MS, CPUSS_IDENTITY) == ((uint32_t)(CPUSS_MS_ID_CM7_0))) ? true : false)
#define CY_IS_CM7_CORE_1 ((_FLD2VAL(CPUSS_IDENTITY_MS, CPUSS_IDENTITY) == ((uint32_t)(CPUSS_MS_ID_CM7_1))) ? true : false)
#if (CY_IP_M7CPUSS_VERSION == 2)
#define CY_IS_CM7_CORE_2 ((_FLD2VAL(CPUSS_IDENTITY_MS, CPUSS_IDENTITY) == ((uint32_t)(CPUSS_MS_ID_CM7_2))) ? true : false)
#define CY_IS_CM7_CORE_3 ((_FLD2VAL(CPUSS_IDENTITY_MS, CPUSS_IDENTITY) == ((uint32_t)(CPUSS_MS_ID_CM7_3))) ? true : false)
#endif

#define CPUSS_IDENTITY                       ((((CPUSS_Type *)(CPUSS_BASE))->IDENTITY))
#define CPUSS_CM7_0_STATUS                   ((((CPUSS_Type *)(CPUSS_BASE))->CM7_0_STATUS))
#define CPUSS_FAST_0_CLOCK_CTL               (((CPUSS_Type*) CPUSS_BASE)->FAST_0_CLOCK_CTL)
#define CPUSS_CM7_0_CTL                      (((CPUSS_Type*) CPUSS_BASE)->CM7_0_CTL)
#define CPUSS_CM7_0_INT_STATUS               (((CPUSS_Type*) CPUSS_BASE)->CM7_0_INT_STATUS)
#define CPUSS_CM7_0_VECTOR_TABLE_BASE        (((CPUSS_Type*) CPUSS_BASE)->CM7_0_VECTOR_TABLE_BASE)
#define CPUSS_CM7_0_NMI_CTL(nmi)             (((volatile uint32_t *) (CPUSS->CM7_0_NMI_CTL))[(nmi)])
#define CPUSS_CM7_1_STATUS                   ((((CPUSS_Type *)(CPUSS_BASE))->CM7_1_STATUS))
#define CPUSS_FAST_1_CLOCK_CTL               (((CPUSS_Type*) CPUSS_BASE)->FAST_1_CLOCK_CTL)
#define CPUSS_CM7_1_CTL                      (((CPUSS_Type*) CPUSS_BASE)->CM7_1_CTL)
#define CPUSS_CM7_1_INT_STATUS               ((((CPUSS_Type *)(CPUSS_BASE))->CM7_1_INT_STATUS))
#define CPUSS_CM7_1_VECTOR_TABLE_BASE        (((CPUSS_Type*) CPUSS_BASE)->CM7_1_VECTOR_TABLE_BASE)
#define CPUSS_CM7_1_NMI_CTL(nmi)             (((volatile uint32_t *) (CPUSS->CM7_1_NMI_CTL))[(nmi)])
#if (CY_IP_M7CPUSS_VERSION == 2)
#define CPUSS_CM7_2_STATUS                   ((((CPUSS_Type *)(CPUSS_BASE))->CM7_2_STATUS))
#define CPUSS_FAST_2_CLOCK_CTL               (((CPUSS_Type*) CPUSS_BASE)->FAST_2_CLOCK_CTL)
#define CPUSS_CM7_2_CTL                      (((CPUSS_Type*) CPUSS_BASE)->CM7_2_CTL)
#define CPUSS_CM7_2_INT_STATUS               ((((CPUSS_Type *)(CPUSS_BASE))->CM7_2_INT_STATUS))
#define CPUSS_CM7_2_VECTOR_TABLE_BASE        (((CPUSS_Type*) CPUSS_BASE)->CM7_2_VECTOR_TABLE_BASE)
#define CPUSS_CM7_2_NMI_CTL(nmi)             (((volatile uint32_t *) (CPUSS->CM7_2_NMI_CTL))[(nmi)])
#define CPUSS_CM7_3_STATUS                   ((((CPUSS_Type *)(CPUSS_BASE))->CM7_3_STATUS))
#define CPUSS_FAST_3_CLOCK_CTL               (((CPUSS_Type*) CPUSS_BASE)->FAST_3_CLOCK_CTL)
#define CPUSS_CM7_3_CTL                      (((CPUSS_Type*) CPUSS_BASE)->CM7_3_CTL)
#define CPUSS_CM7_3_INT_STATUS               ((((CPUSS_Type *)(CPUSS_BASE))->CM7_3_INT_STATUS))
#define CPUSS_CM7_3_VECTOR_TABLE_BASE        (((CPUSS_Type*) CPUSS_BASE)->CM7_3_VECTOR_TABLE_BASE)
#define CPUSS_CM7_3_NMI_CTL(nmi)             (((volatile uint32_t *) (CPUSS->CM7_3_NMI_CTL))[(nmi)])
#endif
#define CPUSS_CM0_CTL                        (((CPUSS_Type*) CPUSS_BASE)->CM0_CTL)
#define CPUSS_CM0_STATUS                     (((CPUSS_Type*) CPUSS_BASE)->CM0_STATUS)
#define CPUSS_SLOW_CLOCK_CTL                 (((CPUSS_Type*) CPUSS_BASE)->SLOW_CLOCK_CTL)
#define CPUSS_PERI_CLOCK_CTL                 (((CPUSS_Type*) CPUSS_BASE)->PERI_CLOCK_CTL)
#define CPUSS_MEM_CLOCK_CTL                  (((CPUSS_Type*) CPUSS_BASE)->MEM_CLOCK_CTL)
#define CPUSS_CM0_INT0_STATUS                ((((CPUSS_Type *)(CPUSS_BASE))->CM0_INT0_STATUS))
#define CPUSS_CM0_INT1_STATUS                ((((CPUSS_Type *)(CPUSS_BASE))->CM0_INT1_STATUS))
#define CPUSS_CM0_INT2_STATUS                ((((CPUSS_Type *)(CPUSS_BASE))->CM0_INT2_STATUS))
#define CPUSS_CM0_INT3_STATUS                ((((CPUSS_Type *)(CPUSS_BASE))->CM0_INT3_STATUS))
#define CPUSS_CM0_INT4_STATUS                ((((CPUSS_Type *)(CPUSS_BASE))->CM0_INT4_STATUS))
#define CPUSS_CM0_INT5_STATUS                ((((CPUSS_Type *)(CPUSS_BASE))->CM0_INT5_STATUS))
#define CPUSS_CM0_INT6_STATUS                ((((CPUSS_Type *)(CPUSS_BASE))->CM0_INT6_STATUS))
#define CPUSS_CM0_INT7_STATUS                ((((CPUSS_Type *)(CPUSS_BASE))->CM0_INT7_STATUS))
#define CPUSS_CM0_NMI_CTL(nmi)               (((volatile uint32_t *) (CPUSS->CM0_NMI_CTL))[(nmi)])
#define CPUSS_CM0_VECTOR_TABLE_BASE          ((((CPUSS_Type *)(CPUSS_BASE))->CM0_VECTOR_TABLE_BASE))
#define CPUSS_CM7_0_PWR_CTL                  ((((CPUSS_Type *)(CPUSS_BASE))->CM7_0_PWR_CTL))
#define CPUSS_CM7_1_PWR_DELAY_CTL            ((((CPUSS_Type *)(CPUSS_BASE))->CM7_1_PWR_DELAY_CTL))
#define CPUSS_RAM0_CTL0                      ((((CPUSS_Type *)(CPUSS_BASE))->RAM0_CTL0))
#define CPUSS_RAM0_STATUS                    ((((CPUSS_Type *)(CPUSS_BASE))->RAM0_STATUS))
#define CPUSS_RAM0_PWR_MACRO_CTL(macroIdx)   ((((CPUSS_Type *)(CPUSS_BASE))->RAM0_PWR_MACRO_CTL[(macroIdx)]))
#define CPUSS_RAM1_CTL0                      ((((CPUSS_Type *)(CPUSS_BASE))->RAM1_STATUS))
#define CPUSS_RAM1_STATUS                    ((((CPUSS_Type *)(CPUSS_BASE))->RAM0_CTL0))
#define CPUSS_RAM1_PWR_CTL                   ((((CPUSS_Type *)(CPUSS_BASE))->RAM1_PWR_CTL))
#define CPUSS_RAM2_CTL0                      ((((CPUSS_Type *)(CPUSS_BASE))->RAM2_CTL0))
#define CPUSS_RAM2_STATUS                    ((((CPUSS_Type *)(CPUSS_BASE))->RAM2_STATUS))
#define CPUSS_RAM2_PWR_CTL                   ((((CPUSS_Type *)(CPUSS_BASE))->RAM2_PWR_CTL))
#define CPUSS_RAM_PWR_DELAY_CTL              ((((CPUSS_Type *)(CPUSS_BASE))->RAM_PWR_DELAY_CTL))
#define CPUSS_ROM_CTL                        ((((CPUSS_Type *)(CPUSS_BASE))->ROM_CTL))
#define CPUSS_ECC_CTL                        ((((CPUSS_Type *)(CPUSS_BASE))->ECC_CTL))
#define CPUSS_PRODUCT_ID                     ((((CPUSS_Type*) CPUSS_BASE)->PRODUCT_ID))
#define CPUSS_CM0_SYSTEM_INT_CTL             (((CPUSS_Type *)(CPUSS_BASE))->CM0_SYSTEM_INT_CTL)
#define CPUSS_CM7_0_SYSTEM_INT_CTL           (((CPUSS_Type *)(CPUSS_BASE))->CM7_0_SYSTEM_INT_CTL)
#define CPUSS_CM7_1_SYSTEM_INT_CTL           (((CPUSS_Type *)(CPUSS_BASE))->CM7_1_SYSTEM_INT_CTL)
#if (CY_IP_M7CPUSS_VERSION == 2)
#define CPUSS_CM7_2_SYSTEM_INT_CTL           (((CPUSS_Type *)(CPUSS_BASE))->CM7_2_SYSTEM_INT_CTL)
#define CPUSS_CM7_3_SYSTEM_INT_CTL           (((CPUSS_Type *)(CPUSS_BASE))->CM7_3_SYSTEM_INT_CTL)
#endif

