zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/devices/COMPONENT_CAT1C/include/cy_device.h
/*******************************************************************************
*               TDM
*******************************************************************************/
#define TDM_STRUCT_Type                             TDM_TDM_STRUCT_Type
#define TDM_TX_STRUCT_Type                          TDM_TDM_STRUCT_TDM_TX_STRUCT_Type
#define TDM_RX_STRUCT_Type                          TDM_TDM_STRUCT_TDM_RX_STRUCT_Type
#define TDM_STRUCT0                                 TDM0_TDM_STRUCT0
#define TDM_STRUCT1                                 TDM0_TDM_STRUCT1
#define TDM_STRUCT0_TX                              TDM0_TDM_STRUCT0_TDM_TX_STRUCT
#define TDM_STRUCT1_TX                              TDM0_TDM_STRUCT1_TDM_TX_STRUCT
#define TDM_STRUCT0_RX                              TDM0_TDM_STRUCT0_TDM_RX_STRUCT
#define TDM_STRUCT1_RX                              TDM0_TDM_STRUCT1_TDM_RX_STRUCT
#define TDM_STRUCT_TX_CTL(base)                     (((TDM_TDM_STRUCT_TDM_TX_STRUCT_Type *)(base))->TX_CTL)
#define TDM_STRUCT_TX_IF_CTL(base)                  (((TDM_TDM_STRUCT_TDM_TX_STRUCT_Type *)(base))->TX_IF_CTL)
#define TDM_STRUCT_TX_CH_CTL(base)                  (((TDM_TDM_STRUCT_TDM_TX_STRUCT_Type *)(base))->TX_CH_CTL)
#define TDM_STRUCT_TX_TEST_CTL(base)                (((TDM_TDM_STRUCT_TDM_TX_STRUCT_Type *)(base))->TX_TEST_CTL)
#define TDM_STRUCT_TX_ROUTE_CTL(base)               (((TDM_TDM_STRUCT_TDM_TX_STRUCT_Type *)(base))->TX_ROUTE_CTL)
#define TDM_STRUCT_TX_FIFO_CTL(base)                (((TDM_TDM_STRUCT_TDM_TX_STRUCT_Type *)(base))->TX_FIFO_CTL)
#define TDM_STRUCT_TX_FIFO_STATUS(base)             (((TDM_TDM_STRUCT_TDM_TX_STRUCT_Type *)(base))->TX_FIFO_STATUS)
#define TDM_STRUCT_TX_FIFO_WR(base)                 (((TDM_TDM_STRUCT_TDM_TX_STRUCT_Type *)(base))->TX_FIFO_WR)
#define TDM_STRUCT_TX_INTR_TX(base)                 (((TDM_TDM_STRUCT_TDM_TX_STRUCT_Type *)(base))->INTR_TX)
#define TDM_STRUCT_TX_INTR_TX_SET(base)             (((TDM_TDM_STRUCT_TDM_TX_STRUCT_Type *)(base))->INTR_TX_SET)
#define TDM_STRUCT_TX_INTR_TX_MASK(base)            (((TDM_TDM_STRUCT_TDM_TX_STRUCT_Type *)(base))->INTR_TX_MASK)
#define TDM_STRUCT_TX_INTR_TX_MASKED(base)          (((TDM_TDM_STRUCT_TDM_TX_STRUCT_Type *)(base))->INTR_TX_MASKED)

#define TDM_STRUCT_RX_CTL(base)                     (((TDM_TDM_STRUCT_TDM_RX_STRUCT_Type *)(base))->RX_CTL)
#define TDM_STRUCT_RX_IF_CTL(base)                  (((TDM_TDM_STRUCT_TDM_RX_STRUCT_Type *)(base))->RX_IF_CTL)
#define TDM_STRUCT_RX_CH_CTL(base)                  (((TDM_TDM_STRUCT_TDM_RX_STRUCT_Type *)(base))->RX_CH_CTL)
#define TDM_STRUCT_RX_TEST_CTL(base)                (((TDM_TDM_STRUCT_TDM_RX_STRUCT_Type *)(base))->RX_TEST_CTL)
#define TDM_STRUCT_RX_ROUTE_CTL(base)               (((TDM_TDM_STRUCT_TDM_RX_STRUCT_Type *)(base))->RX_ROUTE_CTL)
#define TDM_STRUCT_RX_FIFO_CTL(base)                (((TDM_TDM_STRUCT_TDM_RX_STRUCT_Type *)(base))->RX_FIFO_CTL)
#define TDM_STRUCT_RX_FIFO_STATUS(base)             (((TDM_TDM_STRUCT_TDM_RX_STRUCT_Type *)(base))->RX_FIFO_STATUS)
#define TDM_STRUCT_RX_FIFO_RD(base)                 (((TDM_TDM_STRUCT_TDM_RX_STRUCT_Type *)(base))->RX_FIFO_RD)
#define TDM_STRUCT_RX_FIFO_RD_SILENT(base)          (((TDM_TDM_STRUCT_TDM_RX_STRUCT_Type *)(base))->RX_FIFO_RD_SILENT)
#define TDM_STRUCT_RX_INTR_RX(base)                 (((TDM_TDM_STRUCT_TDM_RX_STRUCT_Type *)(base))->INTR_RX)
#define TDM_STRUCT_RX_INTR_RX_SET(base)             (((TDM_TDM_STRUCT_TDM_RX_STRUCT_Type *)(base))->INTR_RX_SET)
#define TDM_STRUCT_RX_INTR_RX_MASK(base)            (((TDM_TDM_STRUCT_TDM_RX_STRUCT_Type *)(base))->INTR_RX_MASK)
#define TDM_STRUCT_RX_INTR_RX_MASKED(base)          (((TDM_TDM_STRUCT_TDM_RX_STRUCT_Type *)(base))->INTR_RX_MASKED)

/*******************************************************************************
*                                    MIXER
*******************************************************************************/
#define MIXER_SRC_STRUCT_Type                            MIXER_MIXER_SRC_STRUCT_Type
#define MIXER_DST_STRUCT_Type                            MIXER_MIXER_DST_STRUCT_Type
#define MIXER_TX_STRUCT_Type                             MIXER_MIXER_TX_STRUCT_Type

#define MIXER_SRC_STRUCT_SRC_CTL(base)                   (((MIXER_SRC_STRUCT_Type *)(base))->SRC_CTL)
#define MIXER_SRC_STRUCT_SRC_STATUS(base)                (((MIXER_SRC_STRUCT_Type *)(base))->SRC_STATUS)
#define MIXER_SRC_STRUCT_SRC_FADE_CTL(base)              (((MIXER_SRC_STRUCT_Type *)(base))->SRC_FADE_CTL)
#define MIXER_SRC_STRUCT_SRC_FADE_STATUS(base)           (((MIXER_SRC_STRUCT_Type *)(base))->SRC_FADE_STATUS)
#define MIXER_SRC_STRUCT_SRC_FADE_CMD(base)              (((MIXER_SRC_STRUCT_Type *)(base))->SRC_FADE_CMD)
#define MIXER_SRC_STRUCT_SRC_GAIN_CTL(base)              (((MIXER_SRC_STRUCT_Type *)(base))->SRC_GAIN_CTL)
#define MIXER_SRC_STRUCT_SRC_FIFO_CTL(base)              (((MIXER_SRC_STRUCT_Type *)(base))->SRC_FIFO_CTL)
#define MIXER_SRC_STRUCT_SRC_FIFO_STATUS(base)           (((MIXER_SRC_STRUCT_Type *)(base))->SRC_FIFO_STATUS)
#define MIXER_SRC_STRUCT_SRC_FIFO_WR(base)               (((MIXER_SRC_STRUCT_Type *)(base))->SRC_FIFO_WR)
#define MIXER_SRC_STRUCT_INTR_SRC(base)                  (((MIXER_SRC_STRUCT_Type *)(base))->INTR_SRC)
#define MIXER_SRC_STRUCT_INTR_SRC_SET(base)              (((MIXER_SRC_STRUCT_Type *)(base))->INTR_SRC_SET)
#define MIXER_SRC_STRUCT_INTR_SRC_MASK(base)             (((MIXER_SRC_STRUCT_Type *)(base))->INTR_SRC_MASK)
#define MIXER_SRC_STRUCT_INTR_SRC_MASKED(base)           (((MIXER_SRC_STRUCT_Type *)(base))->INTR_SRC_MASKED)

#define MIXER_DST_STRUCT_DST_CTL(base)                   (((MIXER_DST_STRUCT_Type *)(base))->DST_CTL)
#define MIXER_DST_STRUCT_DST_FADE_CTL(base)              (((MIXER_DST_STRUCT_Type *)(base))->DST_FADE_CTL)
#define MIXER_DST_STRUCT_DST_FADE_STATUS(base)           (((MIXER_DST_STRUCT_Type *)(base))->DST_FADE_STATUS)
#define MIXER_DST_STRUCT_DST_FADE_CMD(base)              (((MIXER_DST_STRUCT_Type *)(base))->DST_FADE_CMD)
#define MIXER_DST_STRUCT_DST_GAIN_CTL(base)              (((MIXER_DST_STRUCT_Type *)(base))->DST_GAIN_CTL)
#define MIXER_DST_STRUCT_DST_FIFO_CTL(base)              (((MIXER_DST_STRUCT_Type *)(base))->DST_FIFO_CTL)
#define MIXER_DST_STRUCT_DST_FIFO_STATUS(base)           (((MIXER_DST_STRUCT_Type *)(base))->DST_FIFO_STATUS)
#define MIXER_DST_STRUCT_DST_FIFO_RD(base)               (((MIXER_DST_STRUCT_Type *)(base))->DST_FIFO_RD)
#define MIXER_DST_STRUCT_DST_FIFO_RD_SILENT(base)        (((MIXER_DST_STRUCT_Type *)(base))->DST_FIFO_RD_SILENT)
#define MIXER_DST_STRUCT_INTR_DST(base)                  (((MIXER_DST_STRUCT_Type *)(base))->INTR_DST)
#define MIXER_DST_STRUCT_INTR_DST_SET(base)              (((MIXER_DST_STRUCT_Type *)(base))->INTR_DST_SET)
#define MIXER_DST_STRUCT_INTR_DST_MASK(base)             (((MIXER_DST_STRUCT_Type *)(base))->INTR_DST_MASK)
#define MIXER_DST_STRUCT_INTR_DST_MASKED(base)           (((MIXER_DST_STRUCT_Type *)(base))->INTR_DST_MASKED)

#define MIXER_TX_STRUCT_TX_CTL(base)                     (((MIXER_TX_STRUCT_Type *)(base))->TX_CTL)
#define MIXER_TX_STRUCT_TX_IF_CTL(base)                  (((MIXER_TX_STRUCT_Type *)(base))->TX_IF_CTL)
#define MIXER_TX_STRUCT_TX_FIFO_CTL(base)                (((MIXER_TX_STRUCT_Type *)(base))->TX_FIFO_CTL)
#define MIXER_TX_STRUCT_INTR_TX(base)                    (((MIXER_TX_STRUCT_Type *)(base))->INTR_TX)
#define MIXER_TX_STRUCT_INTR_TX_SET(base)                (((MIXER_TX_STRUCT_Type *)(base))->INTR_TX_SET)
#define MIXER_TX_STRUCT_INTR_TX_MASK(base)               (((MIXER_TX_STRUCT_Type *)(base))->INTR_TX_MASK)
#define MIXER_TX_STRUCT_INTR_TX_MASKED(base)             (((MIXER_TX_STRUCT_Type *)(base))->INTR_TX_MASKED)

