zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/devices/COMPONENT_CAT1C/include/cy_device.h
/*******************************************************************************
*                SMARTIO
*******************************************************************************/

#define SMARTIO_PRT_CTL(base)               (((SMARTIO_PRT_Type *)(base))->CTL)
#define SMARTIO_PRT_SYNC_CTL(base)          (((SMARTIO_PRT_Type *)(base))->SYNC_CTL)
#define SMARTIO_PRT_LUT_SEL(base, idx)      (((SMARTIO_PRT_Type *)(base))->LUT_SEL[idx])
#define SMARTIO_PRT_LUT_CTL(base, idx)      (((SMARTIO_PRT_Type *)(base))->LUT_CTL[idx])
#define SMARTIO_PRT_DU_SEL(base)            (((SMARTIO_PRT_Type *)(base))->DU_SEL)
#define SMARTIO_PRT_DU_CTL(base)            (((SMARTIO_PRT_Type *)(base))->DU_CTL)
#define SMARTIO_PRT_DATA(base)              (((SMARTIO_PRT_Type *)(base))->DATA)


/*******************************************************************************
*                SMIF
*******************************************************************************/

#if defined (CY_IP_MXSMIF_VERSION) && (CY_IP_MXSMIF_VERSION >= 4)
/* Feature Flags - Start
 * Few products have very less memory available in BOOT ROM and they do not require
 * SFDP enumeration of Octal parts. Hence, we introduce feature flags to enable
 * specific features only where Octal SFDP enumeration and Hyperbus devices are supported
 * using below feature flags
 */
#define SMIF_OCTAL_SFDP_SUPPORT
#define SMIF_HYPERBUS_DEVICE_SUPPORT
/* Feature Flags - End */

/* Hidden parameter in SAS (SW=No), have to manually create here.  Remove once 
   SAS issue is corrected and this is generated in the MPN. */
#if defined (CY_DEVICE_TVIIC2D6M)
/* 0: Bridge is not present. Only SMIF0 is present. SMIF_NR must be set to 1. 1:
   Bridge is present. Both SMIF0 and SMIF1 are present. SMIF_NR must be set to
   2. */
#define SMIF_BRIDGE_PRESENT                          1
/* Number of SMIFs present - must be set as described in BRIDGE_PRESENT. */
#define SMIF_SMIF_NR                                 2u
#endif

#define SMIF_DEVICE_CTL_WR_EN_Pos                    SMIF_CORE_DEVICE_CTL_WR_EN_Pos
#define SMIF_DEVICE_CTL_CRYPTO_EN_Pos                SMIF_CORE_DEVICE_CTL_CRYPTO_EN_Pos
#define SMIF_DEVICE_CTL_MERGE_EN_Pos                 SMIF_CORE_DEVICE_CTL_MERGE_EN_Pos
#define SMIF_DEVICE_CTL_MERGE_TIMEOUT_Pos            SMIF_CORE_DEVICE_CTL_MERGE_TIMEOUT_Pos
#define SMIF_DEVICE_CTL_TOTAL_TIMEOUT_Pos            SMIF_CORE_DEVICE_CTL_TOTAL_TIMEOUT_Pos
#define SMIF_DEVICE_CTL_TOTAL_TIMEOUT_EN_Pos         SMIF_CORE_DEVICE_CTL_TOTAL_TIMEOUT_EN_Pos
#define SMIF_DEVICE_CTL_ENABLED_Pos                  SMIF_CORE_DEVICE_CTL_ENABLED_Pos
#define SMIF_DEVICE_ADDR_ADDR_Pos                    SMIF_CORE_DEVICE_ADDR_ADDR_Pos
#define SMIF_DEVICE_ADDR_CTL_SIZE3_Pos               SMIF_CORE_DEVICE_ADDR_CTL_SIZE3_Pos
#define SMIF_DEVICE_ADDR_CTL_DIV2_Pos                SMIF_CORE_DEVICE_ADDR_CTL_DIV2_Pos
#define SMIF_DEVICE_RD_CMD_CTL_CODE_Pos              SMIF_CORE_DEVICE_RD_CMD_CTL_CODE_Pos
#define SMIF_DEVICE_RD_CMD_CTL_CODEH_Pos             SMIF_CORE_DEVICE_RD_CMD_CTL_CODEH_Pos
#define SMIF_DEVICE_RD_CMD_CTL_DDR_MODE_Pos          SMIF_CORE_DEVICE_RD_CMD_CTL_DDR_MODE_Pos
#define SMIF_DEVICE_RD_CMD_CTL_WIDTH_Pos             SMIF_CORE_DEVICE_RD_CMD_CTL_WIDTH_Pos
#define SMIF_DEVICE_RD_CMD_CTL_PRESENT2_Pos          SMIF_CORE_DEVICE_RD_CMD_CTL_PRESENT2_Pos
#define SMIF_DEVICE_RD_ADDR_CTL_WIDTH_Pos            SMIF_CORE_DEVICE_RD_ADDR_CTL_WIDTH_Pos
#define SMIF_DEVICE_RD_ADDR_CTL_DDR_MODE_Pos         SMIF_CORE_DEVICE_RD_ADDR_CTL_DDR_MODE_Pos
#define SMIF_DEVICE_RD_MODE_CTL_CODE_Pos             SMIF_CORE_DEVICE_RD_MODE_CTL_CODE_Pos
#define SMIF_DEVICE_RD_MODE_CTL_CODEH_Pos            SMIF_CORE_DEVICE_RD_MODE_CTL_CODEH_Pos
#define SMIF_DEVICE_RD_MODE_CTL_WIDTH_Pos            SMIF_CORE_DEVICE_RD_MODE_CTL_WIDTH_Pos
#define SMIF_DEVICE_RD_MODE_CTL_DDR_MODE_Pos         SMIF_CORE_DEVICE_RD_MODE_CTL_DDR_MODE_Pos
#define SMIF_DEVICE_RD_MODE_CTL_PRESENT2_Pos         SMIF_CORE_DEVICE_RD_MODE_CTL_PRESENT2_Pos
#define SMIF_DEVICE_RD_DUMMY_CTL_SIZE5_Pos           SMIF_CORE_DEVICE_RD_DUMMY_CTL_SIZE5_Pos
#define SMIF_DEVICE_RD_DUMMY_CTL_PRESENT2_Pos        SMIF_CORE_DEVICE_RD_DUMMY_CTL_PRESENT2_Pos
#define SMIF_DEVICE_RD_DATA_CTL_WIDTH_Pos            SMIF_CORE_DEVICE_RD_DATA_CTL_WIDTH_Pos
#define SMIF_DEVICE_RD_DATA_CTL_DDR_MODE_Pos         SMIF_CORE_DEVICE_RD_DATA_CTL_DDR_MODE_Pos
#define SMIF_DEVICE_WR_CMD_CTL_CODE_Pos              SMIF_CORE_DEVICE_WR_CMD_CTL_CODE_Pos
#define SMIF_DEVICE_WR_CMD_CTL_CODEH_Pos             SMIF_CORE_DEVICE_WR_CMD_CTL_CODEH_Pos
#define SMIF_DEVICE_WR_CMD_CTL_DDR_MODE_Pos          SMIF_CORE_DEVICE_WR_CMD_CTL_DDR_MODE_Pos
#define SMIF_DEVICE_WR_CMD_CTL_WIDTH_Pos             SMIF_CORE_DEVICE_WR_CMD_CTL_WIDTH_Pos
#define SMIF_DEVICE_WR_CMD_CTL_PRESENT2_Pos          SMIF_CORE_DEVICE_WR_CMD_CTL_PRESENT2_Pos
#define SMIF_DEVICE_WR_ADDR_CTL_WIDTH_Pos            SMIF_CORE_DEVICE_WR_ADDR_CTL_WIDTH_Pos
#define SMIF_DEVICE_WR_ADDR_CTL_DDR_MODE_Pos         SMIF_CORE_DEVICE_WR_ADDR_CTL_DDR_MODE_Pos
#define SMIF_DEVICE_WR_MODE_CTL_CODE_Pos             SMIF_CORE_DEVICE_WR_MODE_CTL_CODE_Pos
#define SMIF_DEVICE_WR_MODE_CTL_CODEH_Pos            SMIF_CORE_DEVICE_WR_MODE_CTL_CODEH_Pos
#define SMIF_DEVICE_WR_MODE_CTL_WIDTH_Pos            SMIF_CORE_DEVICE_WR_MODE_CTL_WIDTH_Pos
#define SMIF_DEVICE_WR_MODE_CTL_DDR_MODE_Pos         SMIF_CORE_DEVICE_WR_MODE_CTL_DDR_MODE_Pos
#define SMIF_DEVICE_WR_MODE_CTL_PRESENT2_Pos         SMIF_CORE_DEVICE_WR_MODE_CTL_PRESENT2_Pos
#define SMIF_DEVICE_WR_DUMMY_CTL_SIZE5_Pos           SMIF_CORE_DEVICE_WR_DUMMY_CTL_SIZE5_Pos
#define SMIF_DEVICE_WR_DUMMY_CTL_PRESENT2_Pos        SMIF_CORE_DEVICE_WR_DUMMY_CTL_PRESENT2_Pos
#define SMIF_DEVICE_WR_DUMMY_CTL_RWDS_EN_Pos         SMIF_CORE_DEVICE_WR_DUMMY_CTL_RWDS_EN_Pos
#define SMIF_DEVICE_WR_DATA_CTL_WIDTH_Pos            SMIF_CORE_DEVICE_WR_DATA_CTL_WIDTH_Pos
#define SMIF_DEVICE_WR_DATA_CTL_DDR_MODE_Pos         SMIF_CORE_DEVICE_WR_DATA_CTL_DDR_MODE_Pos
#define SMIF_DEVICE_RD_BOUND_CTL_SIZE5_Pos           SMIF_CORE_DEVICE_RD_BOUND_CTL_SIZE5_Pos
#define SMIF_DEVICE_RD_BOUND_CTL_SUB_PAGE_SIZE_Pos   SMIF_CORE_DEVICE_RD_BOUND_CTL_SUB_PAGE_SIZE_Pos
#define SMIF_DEVICE_RD_BOUND_CTL_SUB_PAGE_NR_Pos     SMIF_CORE_DEVICE_RD_BOUND_CTL_SUB_PAGE_NR_Pos
#define SMIF_DEVICE_RD_BOUND_CTL_SUBSEQ_BOUND_EN_Pos SMIF_CORE_DEVICE_RD_BOUND_CTL_SUBSEQ_BOUND_EN_Pos
#define SMIF_DEVICE_RD_BOUND_CTL_PRESENT_Pos         SMIF_CORE_DEVICE_RD_BOUND_CTL_PRESENT_Pos

#define SMIF_DEVICE_CTL_WR_EN_Msk                  SMIF_CORE_DEVICE_CTL_WR_EN_Msk
#define SMIF_DEVICE_CTL_CRYPTO_EN_Msk              SMIF_CORE_DEVICE_CTL_CRYPTO_EN_Msk
#define SMIF_DEVICE_CTL_MERGE_EN_Msk               SMIF_CORE_DEVICE_CTL_MERGE_EN_Msk
#define SMIF_DEVICE_CTL_MERGE_TIMEOUT_Msk          SMIF_CORE_DEVICE_CTL_MERGE_TIMEOUT_Msk
#define SMIF_DEVICE_CTL_TOTAL_TIMEOUT_Msk          SMIF_CORE_DEVICE_CTL_TOTAL_TIMEOUT_Msk
#define SMIF_DEVICE_CTL_TOTAL_TIMEOUT_EN_Msk       SMIF_CORE_DEVICE_CTL_TOTAL_TIMEOUT_EN_Msk
#define SMIF_DEVICE_CTL_ENABLED_Msk                SMIF_CORE_DEVICE_CTL_ENABLED_Msk
#define SMIF_DEVICE_ADDR_ADDR_Msk                  SMIF_CORE_DEVICE_ADDR_ADDR_Msk
#define SMIF_DEVICE_ADDR_CTL_SIZE3_Msk             SMIF_CORE_DEVICE_ADDR_CTL_SIZE3_Msk
#define SMIF_DEVICE_ADDR_CTL_DIV2_Msk              SMIF_CORE_DEVICE_ADDR_CTL_DIV2_Msk
#define SMIF_DEVICE_RD_CMD_CTL_CODE_Msk            SMIF_CORE_DEVICE_RD_CMD_CTL_CODE_Msk
#define SMIF_DEVICE_RD_CMD_CTL_CODEH_Msk           SMIF_CORE_DEVICE_RD_CMD_CTL_CODEH_Msk
#define SMIF_DEVICE_RD_CMD_CTL_DDR_MODE_Msk        SMIF_CORE_DEVICE_RD_CMD_CTL_DDR_MODE_Msk
#define SMIF_DEVICE_RD_CMD_CTL_WIDTH_Msk           SMIF_CORE_DEVICE_RD_CMD_CTL_WIDTH_Msk
#define SMIF_DEVICE_RD_CMD_CTL_PRESENT2_Msk        SMIF_CORE_DEVICE_RD_CMD_CTL_PRESENT2_Msk
#define SMIF_DEVICE_RD_ADDR_CTL_WIDTH_Msk          SMIF_CORE_DEVICE_RD_ADDR_CTL_WIDTH_Msk
#define SMIF_DEVICE_RD_ADDR_CTL_DDR_MODE_Msk       SMIF_CORE_DEVICE_RD_ADDR_CTL_DDR_MODE_Msk
#define SMIF_DEVICE_RD_MODE_CTL_CODE_Msk           SMIF_CORE_DEVICE_RD_MODE_CTL_CODE_Msk
#define SMIF_DEVICE_RD_MODE_CTL_CODEH_Msk          SMIF_CORE_DEVICE_RD_MODE_CTL_CODEH_Msk
#define SMIF_DEVICE_RD_MODE_CTL_WIDTH_Msk          SMIF_CORE_DEVICE_RD_MODE_CTL_WIDTH_Msk
#define SMIF_DEVICE_RD_MODE_CTL_DDR_MODE_Msk       SMIF_CORE_DEVICE_RD_MODE_CTL_DDR_MODE_Msk
#define SMIF_DEVICE_RD_MODE_CTL_PRESENT2_Msk       SMIF_CORE_DEVICE_RD_MODE_CTL_PRESENT2_Msk
#define SMIF_DEVICE_RD_DUMMY_CTL_SIZE5_Msk         SMIF_CORE_DEVICE_RD_DUMMY_CTL_SIZE5_Msk
#define SMIF_DEVICE_RD_DUMMY_CTL_PRESENT2_Msk      SMIF_CORE_DEVICE_RD_DUMMY_CTL_PRESENT2_Msk
#define SMIF_DEVICE_RD_DATA_CTL_WIDTH_Msk          SMIF_CORE_DEVICE_RD_DATA_CTL_WIDTH_Msk
#define SMIF_DEVICE_RD_DATA_CTL_DDR_MODE_Msk       SMIF_CORE_DEVICE_RD_DATA_CTL_DDR_MODE_Msk
#define SMIF_DEVICE_WR_CMD_CTL_CODE_Msk            SMIF_CORE_DEVICE_WR_CMD_CTL_CODE_Msk
#define SMIF_DEVICE_WR_CMD_CTL_CODEH_Msk           SMIF_CORE_DEVICE_WR_CMD_CTL_CODEH_Msk
#define SMIF_DEVICE_WR_CMD_CTL_DDR_MODE_Msk        SMIF_CORE_DEVICE_WR_CMD_CTL_DDR_MODE_Msk
#define SMIF_DEVICE_WR_CMD_CTL_WIDTH_Msk           SMIF_CORE_DEVICE_WR_CMD_CTL_WIDTH_Msk
#define SMIF_DEVICE_WR_CMD_CTL_PRESENT2_Msk        SMIF_CORE_DEVICE_WR_CMD_CTL_PRESENT2_Msk
#define SMIF_DEVICE_WR_ADDR_CTL_WIDTH_Msk          SMIF_CORE_DEVICE_WR_ADDR_CTL_WIDTH_Msk
#define SMIF_DEVICE_WR_ADDR_CTL_DDR_MODE_Msk       SMIF_CORE_DEVICE_WR_ADDR_CTL_DDR_MODE_Msk
#define SMIF_DEVICE_WR_MODE_CTL_CODE_Msk           SMIF_CORE_DEVICE_WR_MODE_CTL_CODE_Msk
#define SMIF_DEVICE_WR_MODE_CTL_CODEH_Msk          SMIF_CORE_DEVICE_WR_MODE_CTL_CODEH_Msk
#define SMIF_DEVICE_WR_MODE_CTL_WIDTH_Msk          SMIF_CORE_DEVICE_WR_MODE_CTL_WIDTH_Msk
#define SMIF_DEVICE_WR_MODE_CTL_DDR_MODE_Msk       SMIF_CORE_DEVICE_WR_MODE_CTL_DDR_MODE_Msk
#define SMIF_DEVICE_WR_MODE_CTL_PRESENT2_Msk       SMIF_CORE_DEVICE_WR_MODE_CTL_PRESENT2_Msk
#define SMIF_DEVICE_WR_DUMMY_CTL_SIZE5_Msk         SMIF_CORE_DEVICE_WR_DUMMY_CTL_SIZE5_Msk
#define SMIF_DEVICE_WR_DUMMY_CTL_PRESENT2_Msk      SMIF_CORE_DEVICE_WR_DUMMY_CTL_PRESENT2_Msk
#define SMIF_DEVICE_WR_DUMMY_CTL_RWDS_EN_Msk       SMIF_CORE_DEVICE_WR_DUMMY_CTL_RWDS_EN_Msk
#define SMIF_DEVICE_WR_DATA_CTL_WIDTH_Msk          SMIF_CORE_DEVICE_WR_DATA_CTL_WIDTH_Msk
#define SMIF_DEVICE_WR_DATA_CTL_DDR_MODE_Msk       SMIF_CORE_DEVICE_WR_DATA_CTL_DDR_MODE_Msk
#define SMIF_DEVICE_MASK_MASK_Msk                  SMIF_CORE_DEVICE_MASK_MASK_Msk

#define SMIF_DEVICE_RD_BOUND_CTL_SIZE5_Msk           SMIF_CORE_DEVICE_RD_BOUND_CTL_SIZE5_Msk
#define SMIF_DEVICE_RD_BOUND_CTL_SUB_PAGE_SIZE_Msk   SMIF_CORE_DEVICE_RD_BOUND_CTL_SUB_PAGE_SIZE_Msk
#define SMIF_DEVICE_RD_BOUND_CTL_SUB_PAGE_NR_Msk     SMIF_CORE_DEVICE_RD_BOUND_CTL_SUB_PAGE_NR_Msk
#define SMIF_DEVICE_RD_BOUND_CTL_SUBSEQ_BOUND_EN_Msk SMIF_CORE_DEVICE_RD_BOUND_CTL_SUBSEQ_BOUND_EN_Msk
#define SMIF_DEVICE_RD_BOUND_CTL_PRESENT_Msk         SMIF_CORE_DEVICE_RD_BOUND_CTL_PRESENT_Msk

#define SMIF_RX_DATA_FIFO_CTL                      SMIF_RX_DATA_MMIO_FIFO_CTL
#define SMIF_RX_DATA_FIFO_RD4                      SMIF_RX_DATA_MMIO_FIFO_RD4
#define SMIF_RX_DATA_FIFO_RD1                      SMIF_RX_DATA_MMIO_FIFO_RD1
#define SMIF_RX_DATA_FIFO_RD2                      SMIF_RX_DATA_MMIO_FIFO_RD2

#define SMIF_TX_DATA_FIFO_CTL                      SMIF_TX_DATA_MMIO_FIFO_CTL
#define SMIF_TX_DATA_FIFO_WR4                      SMIF_TX_DATA_MMIO_FIFO_WR4
#define SMIF_TX_DATA_FIFO_WR1                      SMIF_TX_DATA_MMIO_FIFO_WR1
#define SMIF_TX_DATA_FIFO_WR2                      SMIF_TX_DATA_MMIO_FIFO_WR2

