zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/devices/COMPONENT_CAT1C/include/cy_device.h
#define SMIF_DEVICE_IDX_CTL(base, deviceIndex)             (SMIF_DEVICE_IDX(base, deviceIndex).CTL)
#define SMIF_DEVICE_IDX_ADDR(base, deviceIndex)            (SMIF_DEVICE_IDX(base, deviceIndex).ADDR)
#define SMIF_DEVICE_IDX_ADDR_CTL(base, deviceIndex)        (SMIF_DEVICE_IDX(base, deviceIndex).ADDR_CTL)
#define SMIF_DEVICE_IDX_MASK(base, deviceIndex)            (SMIF_DEVICE_IDX(base, deviceIndex).MASK)
#define SMIF_DEVICE_IDX_RD_CMD_CTL(base, deviceIndex)      (SMIF_DEVICE_IDX(base, deviceIndex).RD_CMD_CTL)
#define SMIF_DEVICE_IDX_RD_ADDR_CTL(base, deviceIndex)     (SMIF_DEVICE_IDX(base, deviceIndex).RD_ADDR_CTL)
#define SMIF_DEVICE_IDX_RD_MODE_CTL(base, deviceIndex)     (SMIF_DEVICE_IDX(base, deviceIndex).RD_MODE_CTL)
#define SMIF_DEVICE_IDX_RD_DUMMY_CTL(base, deviceIndex)    (SMIF_DEVICE_IDX(base, deviceIndex).RD_DUMMY_CTL)
#define SMIF_DEVICE_IDX_RD_DATA_CTL(base, deviceIndex)     (SMIF_DEVICE_IDX(base, deviceIndex).RD_DATA_CTL)
#define SMIF_DEVICE_IDX_WR_CMD_CTL(base, deviceIndex)      (SMIF_DEVICE_IDX(base, deviceIndex).WR_CMD_CTL)
#define SMIF_DEVICE_IDX_WR_ADDR_CTL(base, deviceIndex)     (SMIF_DEVICE_IDX(base, deviceIndex).WR_ADDR_CTL)
#define SMIF_DEVICE_IDX_WR_MODE_CTL(base, deviceIndex)     (SMIF_DEVICE_IDX(base, deviceIndex).WR_MODE_CTL)
#define SMIF_DEVICE_IDX_WR_DUMMY_CTL(base, deviceIndex)    (SMIF_DEVICE_IDX(base, deviceIndex).WR_DUMMY_CTL)
#define SMIF_DEVICE_IDX_WR_DATA_CTL(base, deviceIndex)     (SMIF_DEVICE_IDX(base, deviceIndex).WR_DATA_CTL)
#define SMIF_DEVICE_IDX_RX_CAPTURE_CONFIG(base, deviceIndex)     (SMIF_DEVICE_IDX(base, deviceIndex).RX_CAPTURE_CONFIG)

#define SMIF_CORE_IDX(base, coreIndex)                     (((SMIF_Type *)(base))->CORE[coreIndex])

#define SMIF_CTL(base)                            (((SMIF_CORE_Type *)(base))->CTL)
#define SMIF_CTL2(base)                           (((SMIF_CORE_Type *)(base))->CTL2)
#define SMIF_STATUS(base)                         (((SMIF_CORE_Type *)(base))->STATUS)
#if defined (CY_MXSMIF) && (CY_MXSMIF_VERSION <= 2)
#define SMIF_INT_CLOCK_DELAY_TAP_SEL0(base)       (((SMIF_CORE_Type *)(base))->INT_CLOCK_DELAY_TAP_SEL0)
#define SMIF_INT_CLOCK_DELAY_TAP_SEL1(base)       (((SMIF_CORE_Type *)(base))->INT_CLOCK_DELAY_TAP_SEL1)
#endif
#if defined (SMIF_DLP_PRESENT) && (SMIF_DLP_PRESENT > 0)
#define SMIF_DLP_DELAY_TAP_SEL0(base)             (((SMIF_CORE_Type *)(base))->DLP_DELAY_TAP_SEL0)
#define SMIF_DLP_DELAY_TAP_SEL1(base)             (((SMIF_CORE_Type *)(base))->DLP_DELAY_TAP_SEL1)
#define SMIF_DLP_CTL(base)                        (((SMIF_CORE_Type *)(base))->DLP_CTL)
#define SMIF_DL_STATUS0(base)                     (((SMIF_CORE_Type *)(base))->DL_STATUS0)
#define SMIF_DL_STATUS1(base)                     (((SMIF_CORE_Type *)(base))->DL_STATUS1)
#endif
#define SMIF_TX_CMD_FIFO_STATUS(base)             (((SMIF_CORE_Type *)(base))->TX_CMD_FIFO_STATUS)
#define SMIF_TX_CMD_MMIO_FIFO_STATUS(base)        (((SMIF_CORE_Type *)(base))->TX_CMD_MMIO_FIFO_STATUS)
#define SMIF_TX_CMD_MMIO_FIFO_WR(base)            (((SMIF_CORE_Type *)(base))->TX_CMD_MMIO_FIFO_WR)
#define SMIF_TX_DATA_MMIO_FIFO_CTL(base)          (((SMIF_CORE_Type *)(base))->TX_DATA_MMIO_FIFO_CTL)
#define SMIF_TX_DATA_FIFO_STATUS(base)            (((SMIF_CORE_Type *)(base))->TX_DATA_FIFO_STATUS)
#define SMIF_TX_DATA_MMIO_FIFO_STATUS(base)       (((SMIF_CORE_Type *)(base))->TX_DATA_MMIO_FIFO_STATUS)
#define SMIF_TX_DATA_MMIO_FIFO_WR1(base)          (((SMIF_CORE_Type *)(base))->TX_DATA_MMIO_FIFO_WR1)
#define SMIF_TX_DATA_MMIO_FIFO_WR2(base)          (((SMIF_CORE_Type *)(base))->TX_DATA_MMIO_FIFO_WR2)
#define SMIF_TX_DATA_MMIO_FIFO_WR4(base)          (((SMIF_CORE_Type *)(base))->TX_DATA_MMIO_FIFO_WR4)
#define SMIF_TX_DATA_MMIO_FIFO_WR1ODD(base)       (((SMIF_CORE_Type *)(base))->TX_DATA_MMIO_FIFO_WR1ODD)
#define SMIF_RX_DATA_MMIO_FIFO_CTL(base)          (((SMIF_CORE_Type *)(base))->RX_DATA_MMIO_FIFO_CTL)
#define SMIF_RX_DATA_MMIO_FIFO_STATUS(base)       (((SMIF_CORE_Type *)(base))->RX_DATA_MMIO_FIFO_STATUS)
#define SMIF_RX_DATA_FIFO_STATUS(base)            (((SMIF_CORE_Type *)(base))->RX_DATA_FIFO_STATUS)
#define SMIF_RX_DATA_MMIO_FIFO_RD1(base)          (((SMIF_CORE_Type *)(base))->RX_DATA_MMIO_FIFO_RD1)
#define SMIF_RX_DATA_MMIO_FIFO_RD2(base)          (((SMIF_CORE_Type *)(base))->RX_DATA_MMIO_FIFO_RD2)
#define SMIF_RX_DATA_MMIO_FIFO_RD4(base)          (((SMIF_CORE_Type *)(base))->RX_DATA_MMIO_FIFO_RD4)
#define SMIF_RX_DATA_MMIO_FIFO_RD1_SILENT(base)   (((SMIF_CORE_Type *)(base))->RX_DATA_MMIO_FIFO_RD1_SILENT)
#if defined (SMIF_SLOW_CACHE_PRESENT)
#define SMIF_SLOW_CA_CTL(base)                    (((SMIF_CORE_Type *)(base))->SLOW_CA_CTL)
#define SMIF_SLOW_CA_CMD(base)                    (((SMIF_CORE_Type *)(base))->SLOW_CA_CMD)
#endif
#if defined (SMIF_FAST_CACHE_PRESENT)
#define SMIF_FAST_CA_CTL(base)                    (((SMIF_CORE_Type *)(base))->FAST_CA_CTL)
#define SMIF_FAST_CA_CMD(base)                    (((SMIF_CORE_Type *)(base))->FAST_CA_CMD)
#endif
#if defined (SMIF_BUS_CRC_PRESENT)
#define SMIF_CRC_CMD(base)                        (((SMIF_CORE_Type *)(base))->CRC_CMD)
#define SMIF_CRC_INPUT0(base)                     (((SMIF_CORE_Type *)(base))->CRC_INPUT0)
#define SMIF_CRC_INPUT1(base)                     (((SMIF_CORE_Type *)(base))->CRC_INPUT1)
#define SMIF_CRC_OUTPUT(base)                     (((SMIF_CORE_Type *)(base))->CRC_OUTPUT)
#endif
#define SMIF_INTR(base)                           (((SMIF_CORE_Type *)(base))->INTR)
#define SMIF_INTR_SET(base)                       (((SMIF_CORE_Type *)(base))->INTR_SET)
#define SMIF_INTR_MASK(base)                      (((SMIF_CORE_Type *)(base))->INTR_MASK)
#define SMIF_INTR_MASKED(base)                    (((SMIF_CORE_Type *)(base))->INTR_MASKED)
#if defined (CY_IP_MXSMIF) && (CY_IP_MXSMIF_VERSION >= 5)
#define SMIF_CLK_HSIOM(base)                      (((SMIF_CORE_Type *)(base))->SMIF_HSIOM.SMIF_PRT[1].PORT_SEL0)
#define SMIF_RWDS_HSIOM(base)                     (((SMIF_CORE_Type *)(base))->SMIF_HSIOM.SMIF_PRT[2].PORT_SEL0)
#define SMIF_CLK_DRIVEMODE(base)                  (((SMIF_CORE_Type *)(base))->SMIF_GPIO.SMIF_PRT[1].CFG)
#define SMIF_RWDS_DRIVEMODE(base)                 (((SMIF_CORE_Type *)(base))->SMIF_GPIO.SMIF_PRT[2].CFG)
#define SMIF_CLK_DRIVE_STRENGTH(base)             (((SMIF_CORE_Type *)(base))->SMIF_GPIO.SMIF_PRT[1].CFG_DRIVE_EXT0)
#define SMIF_RWDS_DRIVE_STRENGTH(base)            (((SMIF_CORE_Type *)(base))->SMIF_GPIO.SMIF_PRT[2].CFG_DRIVE_EXT0)
#define SMIF_IDAC(base)                           (((SMIF_CORE_Type *)(base))->DLL_IDAC)
#endif

/* Backward Compatibility - Default SMIF instance pointing to CORE0 */
#if defined (CY_IP_MXSMIF) && (CY_IP_MXSMIF_VERSION >= 4)
#define SMIF_HW SMIF0_CORE0
#define SMIF_config SMIF_0_CORE_0_config
#endif

