zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/devices/COMPONENT_CAT1C/include/cy_device.h
#define CY_GPIO_BASE                       ((uint32_t)GPIO_BASE)

#define GPIO_INTR_CAUSE0                   ((GPIO)->INTR_CAUSE0)
#define GPIO_INTR_CAUSE1                   ((GPIO)->INTR_CAUSE1)
#define GPIO_INTR_CAUSE2                   ((GPIO)->INTR_CAUSE2)
#define GPIO_INTR_CAUSE3                   ((GPIO)->INTR_CAUSE3)

#define GPIO_PRT_OUT(base)                 (((GPIO_PRT_Type*)(base))->OUT)
#define GPIO_PRT_OUT_CLR(base)             (((GPIO_PRT_Type*)(base))->OUT_CLR)
#define GPIO_PRT_OUT_SET(base)             (((GPIO_PRT_Type*)(base))->OUT_SET)
#define GPIO_PRT_OUT_INV(base)             (((GPIO_PRT_Type*)(base))->OUT_INV)
#define GPIO_PRT_IN(base)                  (((GPIO_PRT_Type*)(base))->IN)
#define GPIO_PRT_INTR(base)                (((GPIO_PRT_Type*)(base))->INTR)
#define GPIO_PRT_INTR_MASK(base)           (((GPIO_PRT_Type*)(base))->INTR_MASK)
#define GPIO_PRT_INTR_MASKED(base)         (((GPIO_PRT_Type*)(base))->INTR_MASKED)
#define GPIO_PRT_INTR_SET(base)            (((GPIO_PRT_Type*)(base))->INTR_SET)
#define GPIO_PRT_INTR_CFG(base)            (((GPIO_PRT_Type*)(base))->INTR_CFG)
#define GPIO_PRT_CFG(base)                 (((GPIO_PRT_Type*)(base))->CFG)
#define GPIO_PRT_CFG_IN(base)              (((GPIO_PRT_Type*)(base))->CFG_IN)
#define GPIO_PRT_CFG_OUT(base)             (((GPIO_PRT_Type*)(base))->CFG_OUT)
#define GPIO_PRT_CFG_OUT2(base)            (((GPIO_PRT_Type*)(base))->CFG_OUT2)
#define GPIO_PRT_CFG_SIO(base)             (((GPIO_PRT_Type*)(base))->CFG_SIO)
#define GPIO_PRT_CFG_IN_AUTOLVL(base)      (((GPIO_PRT_Type*)(base))->CFG_IN_AUTOLVL)

#define CY_HSIOM_BASE                      ((uint32_t)HSIOM_BASE)

#define HSIOM_PRT_PORT_SEL0(base)          (((HSIOM_PRT_Type *)(base))->PORT_SEL0)
#define HSIOM_PRT_PORT_SEL1(base)          (((HSIOM_PRT_Type *)(base))->PORT_SEL1)

#define HSIOM_AMUX_SPLIT_CTL(switchCtrl)    (((HSIOM_Type *)HSIOM_BASE)->AMUX_SPLIT_CTL[switchCtrl])

#define ioss_interrupts_gpio_0_IRQn         ioss_interrupts_gpio_dpslp_0_IRQn
#define ioss_interrupts_gpio_1_IRQn         ioss_interrupts_gpio_dpslp_1_IRQn
#define ioss_interrupts_gpio_2_IRQn         ioss_interrupts_gpio_dpslp_2_IRQn
#define ioss_interrupts_gpio_3_IRQn         ioss_interrupts_gpio_dpslp_3_IRQn
#define ioss_interrupts_gpio_4_IRQn         ioss_interrupts_gpio_dpslp_4_IRQn
#define ioss_interrupts_gpio_5_IRQn         ioss_interrupts_gpio_dpslp_5_IRQn
#define ioss_interrupts_gpio_6_IRQn         ioss_interrupts_gpio_dpslp_6_IRQn
#define ioss_interrupts_gpio_7_IRQn         ioss_interrupts_gpio_dpslp_7_IRQn
#define ioss_interrupts_gpio_8_IRQn         ioss_interrupts_gpio_dpslp_8_IRQn
#define ioss_interrupts_gpio_9_IRQn         ioss_interrupts_gpio_dpslp_9_IRQn
#define ioss_interrupts_gpio_10_IRQn        ioss_interrupts_gpio_dpslp_10_IRQn
#define ioss_interrupts_gpio_11_IRQn        ioss_interrupts_gpio_dpslp_11_IRQn
#define ioss_interrupts_gpio_12_IRQn        ioss_interrupts_gpio_dpslp_12_IRQn
#define ioss_interrupts_gpio_13_IRQn        ioss_interrupts_gpio_dpslp_13_IRQn
#define ioss_interrupts_gpio_14_IRQn        ioss_interrupts_gpio_dpslp_14_IRQn
#define ioss_interrupts_gpio_15_IRQn        ioss_interrupts_gpio_dpslp_15_IRQn
#define ioss_interrupts_gpio_16_IRQn        ioss_interrupts_gpio_dpslp_16_IRQn
#define ioss_interrupts_gpio_17_IRQn        ioss_interrupts_gpio_dpslp_17_IRQn
#define ioss_interrupts_gpio_18_IRQn        ioss_interrupts_gpio_dpslp_18_IRQn
#define ioss_interrupts_gpio_19_IRQn        ioss_interrupts_gpio_dpslp_19_IRQn
#define ioss_interrupts_gpio_20_IRQn        ioss_interrupts_gpio_dpslp_20_IRQn
#define ioss_interrupts_gpio_21_IRQn        ioss_interrupts_gpio_dpslp_21_IRQn
#define ioss_interrupts_gpio_22_IRQn        ioss_interrupts_gpio_dpslp_22_IRQn
#define ioss_interrupts_gpio_23_IRQn        ioss_interrupts_gpio_dpslp_23_IRQn
#define ioss_interrupts_gpio_28_IRQn        ioss_interrupts_gpio_dpslp_28_IRQn
#define ioss_interrupts_gpio_29_IRQn        ioss_interrupts_gpio_dpslp_29_IRQn
#define ioss_interrupts_gpio_30_IRQn        ioss_interrupts_gpio_dpslp_30_IRQn
#define ioss_interrupts_gpio_31_IRQn        ioss_interrupts_gpio_dpslp_31_IRQn
#define ioss_interrupts_gpio_32_IRQn        ioss_interrupts_gpio_dpslp_32_IRQn
#define ioss_interrupts_gpio_24_IRQn        ioss_interrupts_gpio_act_24_IRQn
#define ioss_interrupts_gpio_25_IRQn        ioss_interrupts_gpio_act_25_IRQn
#define ioss_interrupts_gpio_26_IRQn        ioss_interrupts_gpio_act_26_IRQn
#define ioss_interrupts_gpio_27_IRQn        ioss_interrupts_gpio_act_27_IRQn
#define ioss_interrupts_gpio_33_IRQn        ioss_interrupts_gpio_act_33_IRQn
#define ioss_interrupts_gpio_34_IRQn        ioss_interrupts_gpio_act_34_IRQn

/*******************************************************************************
*                I2S
*******************************************************************************/
#if (defined(AUDIOSS_I2S) || defined(AUDIOSS0_I2S_I2S))
#define AUDIOSS_I2S_PRESENT
#endif

#define REG_I2S_CTL(base)                   (((I2S_Type*)(base))->CTL)
#define REG_I2S_CMD(base)                   (((I2S_Type*)(base))->CMD)
#define REG_I2S_CLOCK_CTL(base)             (((I2S_Type*)(base))->CLOCK_CTL)
#define REG_I2S_TR_CTL(base)                (((I2S_Type*)(base))->TR_CTL)
#define REG_I2S_TX_CTL(base)                (((I2S_Type*)(base))->TX_CTL)
#define REG_I2S_TX_FIFO_CTL(base)           (((I2S_Type*)(base))->TX_FIFO_CTL)
#define REG_I2S_TX_FIFO_STATUS(base)        (((I2S_Type*)(base))->TX_FIFO_STATUS)
#define REG_I2S_TX_FIFO_WR(base)            (((I2S_Type*)(base))->TX_FIFO_WR)
#define REG_I2S_TX_WATCHDOG(base)           (((I2S_Type*)(base))->TX_WATCHDOG)
#define REG_I2S_RX_CTL(base)                (((I2S_Type*)(base))->RX_CTL)
#define REG_I2S_RX_FIFO_CTL(base)           (((I2S_Type*)(base))->RX_FIFO_CTL)
#define REG_I2S_RX_FIFO_STATUS(base)        (((I2S_Type*)(base))->RX_FIFO_STATUS)
#define REG_I2S_RX_FIFO_RD(base)            (((I2S_Type*)(base))->RX_FIFO_RD)
#define REG_I2S_RX_FIFO_RD_SILENT(base)     (((I2S_Type*)(base))->RX_FIFO_RD_SILENT)
#define REG_I2S_RX_WATCHDOG(base)           (((I2S_Type*)(base))->RX_WATCHDOG)
#define REG_I2S_INTR(base)                  (((I2S_Type*)(base))->INTR)
#define REG_I2S_INTR_SET(base)              (((I2S_Type*)(base))->INTR_SET)
#define REG_I2S_INTR_MASK(base)             (((I2S_Type*)(base))->INTR_MASK)
#define REG_I2S_INTR_MASKED(base)           (((I2S_Type*)(base))->INTR_MASKED)



